{
  "projects": [
    {
    "name": {
      "en": "AgroTech",
      "es": "AgroTech"
    },
    "description": {
      "en": "Platform developed to connect agricultural producers with advisors. Includes testing with JUnit, BDD with Cucumber, and CI/CD pipelines. Added forum and dark mode through experiments.",
      "es": "Plataforma desarrollada para conectar productores agrícolas con asesores. Incluye pruebas con JUnit, BDD con Cucumber y pipelines CI/CD. Se añadió un foro y modo oscuro mediante experimentación."
    },
    "date": {
      "en": "April 2025 - July 2025",
      "es": "Abril 2025 - Julio 2025"
    },
    "image": "agrotech.png",
    "url": "https://github.com/PieroD04/agrotech"
    },
    {
      "name": {
        "en": "Smart Scheduler",
        "es": "Smart Scheduler"
      },
      "description": {
        "en": "Web application to optimize and organize class schedules by entering course data and constraints. Built with React and styled with Tailwind.",
        "es": "Aplicación web para optimizar y organizar horarios académicos ingresando datos de cursos y restricciones. Desarrollada con React y estilizada con Tailwind."
      },
      "date": {
        "en": "February 2025 - March 2025",
        "es": "Febrero 2025 - Marzo 2025"
      },
      "image": "smartscheduler.png",
      "url": "https://github.com/PieroD04/smart-scheduler"
    },
    {
      "name": {
        "en": "Expense Tracker",
        "es": "Expense Tracker"
      },
      "description": {
        "en": "Web app to track personal expenses, categorize spending, and view analytics. Built with Django, React, and PostgreSQL.",
        "es": "Aplicación web para gestionar gastos personales, categorizar dichos gastos y obtener gráficas. Desarrollado con Django, React y PostgreSQL."
      },
      "date": {
        "en": "January 2025 - February 2025",
        "es": "Enero 2025 - Febrero 2025"
      },
      "image": "expensetracker.png",
      "url": "https://github.com/PieroD04/expense-tracker"
    },
    {
      "name": {
        "en": "AgroSupport",
        "es": "AgroSupport"
      },
      "description": {
        "en": "A mobile app for scheduling consultations between farmers and experts, using Spring Boot and Kotlin with Jetpack Compose.",
        "es": "Aplicación móvil para programar consultas entre criadores de cuyes y expertos, utilizando Spring Boot y Kotlin con Jetpack Compose."
      },
      "date": {
        "en": "August 2024 - November 2024",
        "es": "Agosto 2024 - Noviembre 2024"
      },
      "image": "agrosupport.png",
      "url": "https://github.com/PieroD04/agrosupport"
    },
    {
      "name": {
        "en": "DataPathway",
        "es": "DataPathway"
      },
      "description": {
        "en": "A project to optimize data network traffic using Kruskal and Prim algorithms to construct minimum spanning trees on a dataset of 3.5 million network flows.",
        "es": "Proyecto realizado con Python para optimizar el tráfico en redes de datos usando los algoritmos de Kruskal y Prim para optimización de ancho de banda."
      },
      "date": {
        "en": "September 2024 - November 2024",
        "es": "Septiembre 2024 - Noviembre 2024"
      },
      "image": "datapathway.png",
      "url": "https://github.com/PieroD04/algorithmic-complexity-assignment"
    },
    {
      "name": {
        "en": "AgroConnect",
        "es": "AgroConnect"
      },
      "description": {
        "en": "A system for managing guinea pig farms, including resource and expense tracking, and scheduling expert consultations. Developed with Spring Boot and Angular.",
        "es": "Sistema para gestionar granjas de cuyes, con seguimiento de recursos, gastos y programación de consultas con expertos. Desarrollado con Spring Boot y Angular."
      },
      "date": {
        "en": "April 2024 - June 2024",
        "es": "Abril 2024 - Junio 2024"
      },
      "image": "agroconnect.png",
      "url": "https://github.com/PieroD04/agroconnect"
    },
    {
      "name": {
        "en": "CargoApp",
        "es": "CargoApp"
      },
      "description": {
        "en": "A comprehensive system for managing road transportation of goods, optimizing trip management, expense tracking, and real-time monitoring. Built with C# .NET and Vue.js.",
        "es": "Sistema integral para gestionar el transporte terrestre de mercancías, optimizando la gestión de viajes, el seguimiento de gastos y el monitoreo en tiempo real. Desarrollado con C# .NET y Vue.js."
      },
      "date": {
        "en": "April 2024 - June 2024",
        "es": "Abril 2024 - Junio 2024"
      },
      "image": "cargoapp.png",
      "url": "https://github.com/PieroD04/cargoapp"
    },
    {
      "name": {
        "en": "PsychoPro",
        "es": "PsychoPro"
      },
      "description": {
        "en": "A landing page designed to promote an AI-driven expert system for early psychological assessments, developed with HTML, CSS, and JavaScript.",
        "es": "Landing page diseñada para promocionar un sistema experto basado en inteligencia artificial para evaluaciones psicológicas tempranas, desarrollada con HTML, CSS y JavaScript."
      },
      "date": {
        "en": "August 2023 - November 2023",
        "es": "Agosto 2023 - Noviembre 2023"
      },
      "image": "psychopro.png",
      "url": "https://github.com/PieroD04/psychomind"
    },
    {
      "name": {
        "en": "ShopSync",
        "es": "ShopSync"
      },
      "description": {
        "en": "A system developed to optimize shopping cart management and inventory control in a supermarket, using data structures like Binary Search Trees, AVL Trees, Hashtable, and Vector for efficient operations.",
        "es": "Un sistema desarrollado para optimizar la gestión de carritos de compras y el control de inventario en un supermercado, utilizando estructuras de datos como BST, Árboles AVL, Hashtable y Vector para operaciones eficientes."
      },
      "date": {
        "en": "April 2023 - June 2023",
        "es": "Abril 2023 - Junio 2023"
      },
      "image": "shopsync.jpg",
      "url": "https://github.com/yourusername/shopsync"
    },
    {
      "name": {
        "en": "LimaDefender",
        "es": "LimaDefender"
      },
      "description": {
        "en": "Educational game simulating city protection from a virus spread by zombies, developed in C++ with Windows Forms, applying OOP principles.",
        "es": "Juego educativo que simula la protección de una ciudad contra un virus propagado por zombies, desarrollado en C++ con Windows Forms y aplicando principios POO."
      },
      "date": {
        "en": "August 2022 - November 2022",
        "es": "Agosto 2022 - Noviembre 2022"
      },
      "image": "limadefender.jpeg",
      "url": "https://github.com/PieroD04/LimaDefender"
    },
    {
      "name": {
        "en": "Nine Men's Morris Game",
        "es": "Juego del Molino"
      },
      "description": {
        "en": "A console game developed in C++ for practicing control structures, modular design, and arrays in an algorithmic context.",
        "es": "Juego en consola desarrollado en C++ para practicar estructuras de control, diseño modular y uso de arreglos en el contexto de algoritmos."
      },
      "date": {
        "en": "April 2022 - June 2022",
        "es": "Abril 2022 - Junio 2022"
      },
      "image": "molino.png",
      "url": "https://github.com/PieroD04/Nine-Mens-Morris"
    }
  ]
}